# DividedSurfaceDiscardedSplittersWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DividedSurfaceFailures..::..DividedSurfaceDiscardedSplittersWarning Property
BuiltInFailures..::..DividedSurfaceFailures Class See Also
---
Not all intersecting references (levels, reference planes or lines) could be used to intersect the surface
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DividedSurfaceDiscardedSplittersWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfaceDiscardedSplittersWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DividedSurfaceDiscardedSplittersWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace